Repository: autohotkey-docs-translation/v1-nl
Catalog: omegat/project_save.tmx
Source language: en
Languages: nl

source: "AutoHotkey Help",,,"docs\AutoHotkey.htm","docs\AutoHotkey.htm",,,,,0x73500,,0x10200e,[200,0,1080,700],,,,,3,,0
nl: "AutoHotkey Hulp",,,"docs\AutoHotkey.htm","docs\AutoHotkey.htm",,,,,0x73500,,0x10200e,[200,0,1080,700],,,,,3,,0

source: "en":true,
nl: "en":"nl",

source: "https://github.com/Lexikos/AutoHotkey_L-Docs/edit/v1/docs/":true,
nl: "https://github.com/Lexikos/AutoHotkey_L-Docs/edit/v1/docs/":"https://github.com/autohotkey-docs-translation/v1-nl/edit/master/target/docs/",

source: #Include <LibName> explicitly includes a library file which may be located in any one of the function libraries.
nl: #Include <LibName> vermeldt expliciet een bibliotheek bestand die zich kan te bevinden in een van de functie bibliotheken.

source: ActiveX controls such as the Internet Explorer WebBrowser control are supported.
nl: ActiveX controls zoals de Internet Explorer Webbrowser control is ondersteund.

source: FileRead, FileReadLine, Loop Read and FileAppend support the majority of Windows-supported text encodings, not just the system default ANSI code page.
nl: FileRead, FileReadLine, Loop Read and FileAppend ondersteund het overgrote deel van de Windows-ondersteunende tekst codering, niet enkel de standaard systeem ANSI code pagina.

source: Font quality can be controlled by the Font sub-command.
nl: Font quality kan gecontroleerd worden door het sub-command Font.

source: Gui, New creates a new anonymous GUI.
nl: Gui, New maakt een nieuwe anonieme GUI aan.

source: GuiControlGet, OutputVar, Name gets the name of the variable associated with a GUI control.
nl: GuiControlGet, OutputVar, Name geeft de naam van de variabele geassocieerd met de GUI control.

source: Improvements were made to the way parameters are parsed.
nl: Verbeteringen werden gemaakt aan de manier hoe parameters werden ingelezen.

source: Script compatibility - AutoHotkey 1.0 users read this
nl: Script comptabiliteit - AutoHotkey 1.0 gebruikers moeten het lezen

source: Scripting language:
nl: Scripting taal:

source: Variadic functions can receive a variable number of parameters via an array, while variadic function-calls can be used to pass a variable number of parameters to a function.
nl: Variadic functions kunnen een variabel aantal parameters via een array ontvangen, terwijl variadic function-calls kunnen gebruikt worden om een aantal parameters door te geven aan een functie.

source: FileEncoding can be used to set the default encoding, which can be overridden for FileRead and FileAppend as follows:
nl: FileEncoding kan gebruikt worden om de standaard codering in te stellen, wat dan kan overschreven worden voor FileRead and FileAppend zoals volgt:

source: See also: Script Compatibility
nl: Zie ook: Script Compatibility

source: See also: Text Encodings
nl: Zie ook: Text Encodings

source: Caution: This document has been neglected in recent years and may be missing some of the more recent changes.
nl: Opgelet: Dit document is wat verwaarloosd in recente jaren en kan niet helemaal up-to-date zijn.

source: Tip: If your browser supports it, you can download any code block (such as the one above) as a script file by clicking the button which appears in the top-right of the code block when you hover your mouse over it.
nl: Tip: als je browser het ondersteunt, kan je elke blok code (zoals de degene hierboven), downloaden als een script-bestand door op de knop te klikken die in de rechterbovenhoek tevoorschijn komt wanneer je erover beweegt met je muis.

source: A name or HWND can be used instead of a number between 1 and 99 when referring to a GUI.
nl: Een name or HWND kan gebruikt worden in plaats van een nummer tussen 1 en 99 wanneer gerefereerd wordt naar een GUI.

source: A GUI's owner can be any arbitrary window:
nl: Een GUI's eigenaar kan iedere willekeurige scherm zijn:

source: A number of enhancements have been made to the Gui command and related:
nl: een aantal verbeteringen zijn aangebracht aan deGui command en gerelateerd:

source: A running script can usually be reloaded via its tray menu.
nl: Een lopend script kan normaal gezien gereload worden via zijn systeemmenu.

source: A script can do as little as performing a single action and then exiting, but most scripts define a number of hotkeys, with each hotkey followed by one or more actions to take when the hotkey is pressed.
nl: Een script kan één enkele actie uitvoeren en dan stoppen, maar de meeste scripts definiëren een aantal hotkeys, waarbij iedere hotkey gevolgd wordt door een of meerdere acties wanneer de hotkey is ingedrukt pressed.

source: A script is simply a plain text file with the .ahk filename extension containing instructions for the program, like a configuration file, but much more powerful.
nl: Een script is een platte tekst-bestand met de .ahk bestandsextensie die de instucties bevat voor het programma, zoals een configuratie-bestand, maar dan krachtiger.

source: A special thanks to Jonathan Bennett, whose generosity in releasing AutoIt v2 as free software in 1999 served as an inspiration and time-saver for myself and many others worldwide.
nl: Een speciale dank aan Jonathan Bennet, wiens vrijgevigheid in het openstellen van AutoIt v2 als open-source software in 1999 de basis legde als een inspiratie en tijdbespaarder voor mijzelf en vele anderen wereldwijd

source: Acknowledgements
nl: Erkenning

source: Additionally, the following commands now set A_LastError to assist with debugging:
nl: bovendien, de volgende commands gebruiken nu A_LastError bij het assisteren met debugging:

source: After creating the default script, launch AutoHotkey via the shortcut in the Start menu to run it.
nl: Nadat je de standaard script hebt aangemaakt, start AutoHotkey via de snelkoppeling in het Start menu om het script te starten.

source: After editing a script, you must run or reload the script for the changes to take effect.
nl: Na het bewerken van een script moet je nog run of reload de script doen vooraleer de aanpassingen effect hebben.

source: Allows items in a collection to be enumerated.
nl: Laat items in een collectie toe om samen te voegen.

source: Allows registry commands in a 32-bit script to access the 64-bit registry view and vice versa.
nl: Laat register opdrachten in een 32-bit script toe verbinding te maken met het 64-bit register view en vice versa.

source: Any number of named or anonymous GUIs can be created.
nl: Gelijk welke GUI op basis van een nummer van naam of een anonieme GUIs kan gemaakt worden.

source: Applicable to any type of Loop.
nl: Van toepassing op alle types van loop.

source: Associative arrays which can be extended with other functionality.
nl: Associative arrays die kunnen uitgebreid worden met andere functionaliteiten.

source: AutoHotkey Help
nl: AutoHotkey Hulp

source: AutoHotkey doesn't do anything on its own; it needs a script to tell it what to do.
nl: AutoHotkey doet niets uit zichzrlf , het heeft een script nodig om te zeggen wat het moet doen.

source: AutoHotkey_L New Features
nl: AutoHotkey_L Nieuwe functionaliteiten

source: AutoHotkey_L New Features | AutoHotkey
nl: Autohotkey_L nieuwe functionaliteiten | AutoHotkey

source: Be sure to save the file as UTF-8 with BOM if it will contain non-ASCII characters.
nl: Zorg ervoor om het bestand op te slaan als een UTF-8 met BOM als het geen non-ASCII karakters bevat.

source: Behaviour and usage of objects in general.
nl: Gedrag en gebruik van objecten in het algemeen.

source: Break out of a loop or any number of nested loops.
nl: Stopt de loop of aantal geneste lussen.

source: By default this will open Notepad, but that can be changed by writing to the registry as shown here.
nl: Standaard zal deze opengaan in kladblok maar dat kan veranderd worden door naar het register te schrijven zoals here. beschreven staat.

source: Call AutoHotkey.exe on the command line and pass the script's filename as a command-line parameter.
nl: Aanroep AutoHotkey.exe in de command line en geef de naam van het script als command-line parameter.

source: Calls a function during evaluation of a regex pattern.
nl: Roept een functie gedurende de evaluatie van een regex patroon.

source: Changes affecting script compatibility.
nl: Veranderingen script comptabiliteit.

source: Changes which key is used to mask Win or Alt keyup events.
nl: Verandert welke knop gebruikt wordt om hetgeen de Windows-knop of de Alt-knop normaal doet te maskeren.

source: Command Line Usage
nl: Gebruik van Command Line

source: Command and function list
nl: Lijst van Command en functies

source: Connects a COM object's event sources to functions with a given prefix.
nl: Connecteert met een COM object's event bron van functies met een meegegeven prefix.

source: Contains 1 (true) if the OS is 64-bit or 0 (false) if it is 32-bit.
nl: Bevat 1 (waar) als het OS 64-bit is of 0 (onwaar) als het een 32-bit is.

source: Contains the default encoding for various commands; see FileEncoding.
nl: Bevat de standaard codering voor diverse commands; zie FileEncoding.

source: Contains the size of a pointer, in bytes.
nl: Bevat de grote van de pointer, in bytes.

source: Continue a loop, even from within any number of nested loops.
nl: Verdergaan met de loop, zelfs van binnenin een geneste loop.

source: Controls which artificial keyboard and mouse events are ignored by hotkeys and hotstrings.
nl: Controleert welk artificieel keyboard en muis events zijn genegeerd door hotkeys en hotstrings.

source: Copies a string to or from a memory address, optional converting it between code pages.
nl: Kopieert een string naar of van een geheugen-adres, converteert het optioneel tussen code pagina's.

source: Create a Script
nl: Maak een Script

source: Creates a COM object.
nl: Maakt een COM object.

source: Creates a SAFEARRAY for use with COM.
nl: Maakt een SAFEARRAY om te gebruiken met COM.

source: Creates an exception object for Throw (also provides limited access to the call stack).
nl: Maak een uitzondering's object aan voor Throw (biedt ook een beperkte toegang tot de call stack).

source: Description
nl: Omschrijving

source: Determines whether a ByRef parameter was supplied with a variable.
nl: Bepaalt of een ByRef parameter was geleverd met een variabele.

source: Determines whether a value is an object.
nl: Bepaalt of een variabele een object is.

source: Double-click a script file (or shortcut to a script file) in Explorer.
nl: Dubbel-klik een script-bestand (of snelkoppeling naar een script-bestand) in Verkenner.

source: Edit a Script
nl: Bewerk een Script

source: Embedded Scripts
nl: Ingesloten Scripts

source: Enables or disables notification of COM errors.
nl: Activeert of de-activeert van foutmeldingen over COM.

source: Enables or disables warnings for selected conditions that may be indicative of developer errors.
nl: Activeert of de-activeert meldingen voor geselecteerde bepalingen die de ontwikkelaar op fouten wijzen.

source: Equivalent to Int in 32-bit builds and Int64 in 64-bit builds.
nl: Equivalent vanInt in 32-bit builds en Int64 in 64-bit builds.

source: Error Handling
nl: Fouten opvangen

source: Feature
nl: Item

source: Finally, AutoHotkey would not be what it is today without these other individuals.
nl: Als laatste, AutoHotkey zou niet zijn wat het vandaag is zonderdeze individuele personen.

source: For details, see the FAQ.
nl: Voor meer info, zie FAQ.

source: For example, the following sets the tray icon to the default icon used by ahk files:
nl: Bijvoorbeeld, het volgende zet het systeempictogram naar het standaard icoon die gebruikt wordt door ahk-bestanden:

source: For example:
nl: Bijvoorbeeld:

source: For more information, see Libraries of Functions.
nl: Voor meer informatie, zieLibraries of Functions.

source: Frequently asked questions
nl: Veel gestelde vragen

source: Function Libraries
nl: Functies Bibiotheek

source: Functions
nl: Functies

source: Functions may accept a variable number of parameters via an array.
nl: Functies kunnen een variabel aantal parameters via een array ontvangen.

source: GUI Enhancements
nl: GUI verbeteringen

source: Getting started:
nl: Aan de slag:

source: History of AutoHotkey_L revisions.
nl: Geschiedenis van AutoHotkey_L revisions.

source: Hotkeys (mouse, joystick and keyboard shortcuts)
nl: Hotkeys (muis, joystick and toetsenbord sneltoetsen)

source: Hotstrings and auto-replace
nl: Hotstrings en auto-replace

source: How to deal with Unicode in DllCall(), etc.
nl: Hoe je moet omgaan metUnicode in DllCall(), etc.

source: How to use the program
nl: Hoe moet je het programma gebruiken

source: Icon resources of any size supported by the operating system may be extracted from executable files.
nl: Icon bronen van alle grootte die ondersteund worden door het OS kunnen gewonnen worden van executable bestanden.

source: If AutoHotkey is pinned to the taskbar or Start menu on Windows 7 or later, recent or pinned scripts can be launched via the program's Jump List.
nl: Als AutoHotkey is vastgepind aan de taakbalk of de Start menu van Windows 7 of later, recente of vastgepinde scripts kunnen gestart worden van de program's Jump List.

source: If the script is already running, you can use the Edit command or right-click the script's tray icon and select Edit This Script.
nl: Als een script al loopt, kan je de Edit opdracht gebruiken of klik rechts op het systeemicon van het script en kies Edit This Script.

source: Improvements to Icon Support
nl: Verbeteringen aan het Icon

source: In ANSI builds it is not defined, so is effectively false.
nl: In ANSI builds is dit niet gedefinieerd, dus effectief onwaar.

source: In Explorer, right-click in empty space in the folder where you want to save the script, then select New and AutoHotkey Script.
nl: In Verkenner, klik rechts in een map waar die het script wil bewaren, vervolgens kies jeNieuw en AutoHotkey Script.

source: In Notepad (or a text editor of your choice), save a file with the .ahk filename extension.
nl: In kladblok (of een text editor naar keuze), sla een bestand op met de bestand extensie .ahk.

source: In Unicode builds, this variable contains 1 (true).
nl: In Unicode builds, deze variabele bevat 1 (waar).

source: In addition to the user library in %A_MyDocuments%\AutoHotkey\Lib and standard library in the AutoHotkey directory, functions may be auto-included from the "local library" which resides in %A_ScriptDir%\Lib.
nl: In aanvulling tot de gebruikers-bibliotheek in %A_MyDocuments%\AutoHotkey\Lib en de standaard bibliotheek in de AutoHotkey map, functiies kunnen automatisch toegevoegd worden van de "local library" die zich bevindt in %A_ScriptDir%\Lib.

source: In addition, many of AutoHotkey's enhancements to the AutoIt v2 command set, as well as the Window Spy and the old script compiler, were adapted directly from the AutoIt v3 source code.
nl: Ter aanvulling, veel van de Autohotkey's verbeteringen aan de AutoIt v2 command set, alsook Window Spy en de oude script compiler, werden direct van AutoIt v3 broncode aangepast.

source: Includes a script file from a function library folder.
nl: Voegt een script bestand vanuit een functie-bibliotheek map.

source: Installer Options
nl: Instaleer Opties

source: Interactive debugging
nl: Interactief debugging

source: Interactive debugging features (line by line execution etc.).
nl: Interactief debugging eigenschappen (lijn na lijn uitvoering etc.).

source: Keyboard accelerators such as Ctrl+O are supported automatically when used in Gui menus.
nl: Toetsenbordversnellers zoals Ctrl+O zijn automatisch ondersteund bij het gebruik van Gui menus.

source: Keyboard and mouse:
nl: Toetsenbord en muis:

source: Learn details about creating, editing and running a script, the tray icon, the main window, command line usage, portability and installer options.
nl: Leer details over het aanmaken, aanpassen en starten van een script, het systeemicon, het algemeen scherm, gebruik van de command lijn, de mobiliteit en de opties van de installer.

source: Learn the new features added in the AutoHotkey_L branch of AutoHotkey development, now simply known as "AutoHotkey 1.1".
nl: Leer de nieuwe functionaliteiten die toegevoegd zijn in de AutoHotkey_L branch van AutoHotkey ontwikkeling, nu gekend als "AutoHotkey 1.1".

source: List of keys, mouse buttons and joystick controls
nl: Lijst van toetsen, muisknoppen en joystick controls

source: Loop through the contents of an object.
nl: Loop door de inhoud van een object.

source: Loop until a condition is true.
nl: Loop until een voorwaarde is waar (true).

source: Main Window
nl: Hoofdvenster

source: Many commands support using try/catch instead of ErrorLevel for error handling.
nl: Veel commands ondersteunen het gebruik vantry/catch in plaats vanErrorLevel voor het opvangen van fouten.

source: Miscellaneous topics
nl: Allerlei

source: Most scripts have an effect only while they are running.
nl: De meeste scripts hebben enkel een effect terwijl ze lopen (actief zijn).

source: MsgBox % Time() "ms since the script started."
nl: MsgBox % Time() "ms sinds het script is gestart."

source: MsgBox An error occured!
nl: MsgBox Er trad een fout op!

source: Negative icon numbers may be used to identify a group icon resource within an executable file.
nl: Negatieve icon nummers kunnen gebruikt worden om een groep icon te identificeren binnenin een executable bestand.

source: New "local library" and #Include <LibName>.
nl: Nieuw "lokale bibliotheek" en #Include <LibName>.

source: New GUI options:
nl: Nieuwe GUI opties:

source: Objects
nl: Objecten

source: Of course, you can always open your text editor first and then open the script as you would any other text file.
nl: Je kan natuurlijk ook altijd eerst de text editor openen en daarna het script openen zoals je dat zou doen bij elk ander tekstbestand.

source: On some systems you may need to enclose the name in quotes to ensure the editor does not add another extension (such as .txt).
nl: Sommige systemen is het mogelijk dat je de naam in quotes moet zetten zodat de editor geen er andere extensie aan toevoegt (zoals .txt).

source: Other
nl: Andere

source: Other:
nl: Ander::

source: Perform code page or HTML transformations.
nl: Voert code pagina of HTML transformaties.

source: Portability of AutoHotkey.exe
nl: Meeneembaarheid van AutoHotkey.exe

source: Prior to revision 17, an arbitrary icon resource was selected by the system, scaled to the system large icon size, then scaled back to the requested size.
nl: Eerdere revisie 17, een willekeuringe icon-bron was geselecteerd door het systeem, geschaald naar het grote icon van het systeem, waarna het terug werd geschaald naar de gevraagde grootte.

source: Provides an interface to access a file.
nl: Biedt een interface toegang tot een bestand aan.

source: Provides object-oriented file I/O.
nl: Biedt een object georienteerd bestand I/O.

source: Provides structured exception handling.
nl: Zorgt voor een gestructureerde afhandeling van uitzonderingen.

source: Queries a COM object for an interface or service.
nl: Query's een COM object voor een interface of een dienst.

source: Read, write or delete entire sections, or retrieve a list of all section names.
nl: Lees, schrijf of verwijder gehele secties, of haal een lijst van alle sectie namen op.

source: RegEx quick reference
nl: RegEx snelle referenties

source: Remapping keys and buttons
nl: Opnieuw toewijzen van toetsen en knoppen

source: Represents a user-defined or built-in function which can be called by the script.
nl: Vertegenwoordigd een user-defined of ingebouwde function die door het script kan worden aangeroepen.

source: Resource identifiers and improved support for various icon sizes.
nl: Bron identifiers en verbeterde hulp voor verscheidene icon groottes.

source: Retrieves a reference to a function.
nl: Krijgt een reference naar een functie terug.

source: Retrieves a COM object's type information.
nl: Krijgt de informatie van het type van het COM-object terug.

source: Retrieves a registered COM object.
nl: Krijgt een geregistreerd COM-object terug.

source: Retrieves the full path and name of the process that owns a given window.
nl: Haalt het volledige path en naam van het process die is toegekend aan een bepaald scherm.

source: Retrieves the name or text, virtual key code or scan code of a key.
nl: Krijgt de naam of de tekst, virtuele knop code of scan code van de knop.

source: Retrieves the value or pointer stored in a COM wrapper object.
nl: Krijgt de waarde of de pointer opgeslagen in een COM wrapper object.

source: Retrieves type information from a COM object.
nl: Krijgt het type informatie van een COM object terug.

source: Returns a reference to an object provided by a COM component.
nl: Geeft een referentie naar een object verstrekt door een COM component terug.

source: Run a Script
nl: Start een Script

source: Run with UI Access
nl: Start met UI Access

source: Searches for a given occurrence of a string, from the left or the right.
nl: Zoekt naar een opgeheven occurrence of een string, van links naar rechts.

source: See GUI Enhancements below.
nl: Zie GUI Verbeteringen hieronder.

source: See Scripting Language for details about how to write a script.
nl: Zie Scripting Language voor details over hoe je een script moet schrijven.

source: See ComObj functions above.
nl: Zie ComObj functies hieboven.

source: Sends a Unicode character.
nl: Zet een Unicode karakters.

source: Set lower-case or upper-case hexadecimal format.
nl: Zet tekst in kleine- of drukletters en dit in hexadecimaal formaat.

source: Sets or removes a menu item's icon.
nl: Stelt het icon van het menu in, of verwijdert ze .

source: Sets the default encoding for FileRead, FileReadLine, Loop Read, FileAppend, and FileOpen().
nl: Zet de standaard codering voor FileRead, FileReadLine, Loop Read, FileAppend, and FileOpen().

source: Sets the maximum time that may be spent evaluating a single #If expression.
nl: Zet de maximum tijd die mogelijk is om één enkele #If expression te evalueren / beoordelen.

source: Similar to #IfWinActive, but for arbitrary expressions.
nl: Gelijkaardig aan #IfWinActive, maar voor arbitraire expressies.

source: So thanks to Jon and the other AutoIt authors for those as well.
nl: Dus ook een dankjewel aan de andere AutoIt auteurs

source: Software License:
nl: Software licentie:

source: Static variables can now be initialized using any expression.
nl: Static variables kunnen nu geïinitialiseerd worden via een expressie.

source: Supported by DllCall(), NumPut() and NumGet().
nl: Ondersteund door DllCall(), NumPut() and NumGet().

source: Supported only by DllCall(); see Script Compatibility.
nl: Ondersteunt enkel door DllCall(); see Script Compatibility.

source: Supports Windows 7 and Windows 8; see A_OSVersion.
nl: Ondersteunt Windows 7 en Windows 8; zie A_OSVersion.

source: Table of Contents
nl: Inhoudstafel

source: Text Encodings
nl: Text Codering

source: Text editors with AutoHotkey support
nl: Tekst editors die AutoHotkey ondersteunen

source: The current registry view as set by SetRegView.
nl: De huidige register hoe het gezet is door SetRegView.

source: The name of the last key which was pressed prior to the most recent key-press or key-release ... (More)
nl: De naam van de laatste ingedrukte knop voorafgaand aan de meest recente ingedrukte knop of losgelaten knop ... (More)

source: The unique ID (HWND/handle) of the script's hidden main window.
nl: De unieke ID (HWND/handle) van de script's verborgen hoofdscherm.

source: There are a couple of common ways to create a script file:
nl: er zijn enkele gangbare manieren om een script bestand te maken:
